[setting]
manual=사용법 :`n`n1. 폴더 선택 버튼으로 대상 폴더의 파일 목록을 불러옵니다.`n`n    - 폴더를 창에 드래그하여 불러올 수도 있습니다.`n`n`n2. 이곳에서 파일명을 문서 편집하듯이 자유로이 편집합니다.`n`n    - 복사, 붙여넣기도 가능합니다.`n`n`n3. 파일명 변경을 눌러 변경사항을 저장합니다.`n`n    - 파일명 변경을 누르지 않고 프로그램을 종료하거나`n       경로 재선택시 모든 편집 내용이 사라집니다.
update_log=version 1.7`n - "자릿수 채우기" 실패시 일어나던 오류 수정`n - 새로고침 기능 및 설정 탭 추가`n - 이전 설정을 기억하도록 수정 (폴더 불러오기, F5 새로고침, 업데이트 설정)`n`n`nversion 1.6`n - "파일명 변경", "뒤쪽에 추가" 오류 수정 및 기능 개선`n - 버전 확인 및 자동 업데이트 기능 추가`n - 업데이트 로그(변경사항) 디자인 변경`n`n`nversion 1.5`n - 디자인 개편`n - 자릿수 채우기 오류 수정 및 기능 개편`n - 버튼을 통한 편집시 자동으로 임시 저장이 되도록 수정`n`n`nversion 1.4`n - 목록을 불러올 때 폴더도 불러올 수 있도록 기능 추가`n - 파일 확장자 일괄 변경 가능하도록 기능 추가`n - 1.1 버전에서 추가된 기능의 오류를 해결`n`n`nversion 1.3`n - UI의 좌표값이 고정되어 단일모니터에서 창이 안나타나던 문제를 수정`n`n`nversion 1.2`n - 파일 이름이 길 경우 자동 줄넘김이 일어나지 않도록 수정`n`n`nversion 1.1`n - 폴더를 드래그하여 불러들이는 기능 추가`n`n`nversion 1.0`n - 기본
version=v1.8
releases_path=https://github.com/JANGOON-No89/EZ-ReNamer_with.AHK/releases
download_url=https://github.com/JANGOON-No89/EZ-ReNamer_with.AHK/raw/main/ReNamer.exe